reqv.xml


   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sdk="sdkrtn">
   <soapenv:Header/>
      <soapenv:Body>
      <sdk:OpoRoib>
         <!--Optional:-->
         <sdk:hazardousObjectRoib RoibOpoValue="1" RoibOpoDateTime="2022-10-30T09:51:11.066024+03:00" RoibOpoDescription="Низкий риск"  HazardousObjectNumber="А38-00001-3001" RequestGuid="deff8706-84f5-4e57-85c8-1db6c471aa96" Ogrn="1023001538460" ID="1" >
            <!--Optional:-->
            <sdk:Signature>
               <!--Optional:-->
               <sdk:SignedInfo>
                  <!--Optional:-->
                  <sdk:CanonicalizationMethod Algorithm="?"/>
                  <!--Optional:-->
                  <sdk:SignatureMethod Algorithm="?"/>
                  <!--Optional:-->
                  <sdk:Reference URI="?">
                     <!--Optional:-->
                     <sdk:Transforms>
                        <!--Zero or more repetitions:-->
                        <sdk:Transform Algorithm="?"/>
                     </sdk:Transforms>
                     <!--Optional:-->
                     <sdk:DigestMethod Algorithm="?"/>
                     <!--Optional:-->
                     <sdk:DigestValue>?</sdk:DigestValue>
                  </sdk:Reference>
               </sdk:SignedInfo>
               <!--Optional:-->
               <sdk:SignatureValue>?</sdk:SignatureValue>
               <!--Optional:-->
               <sdk:KeyInfo>
                  <!--Optional:-->
                  <sdk:X509Data>
                     <!--Optional:-->
                     <sdk:X509Certificate>?</sdk:X509Certificate>
                  </sdk:X509Data>
               </sdk:KeyInfo>
            </sdk:Signature>
         </sdk:hazardousObjectRoib>
      </sdk:OpoRoib>
   </soapenv:Body>
    </soap12:Envelope>
    